adityaxavier/OB1203_br/OB1203RL78L13/r_iic_drv_rl78/r_iic_drv_sfr_rl78l1c.c
/********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only
* intended for use with Renesas products. No other uses are authorized.
* This software is owned by Renesas Electronics Corporation and is protected under
* all applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES
* REGARDING THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY,
* INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, FITNESS FOR A
* PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY
* DISCLAIMED.
* TO THE MAXIMUM EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS
* ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES SHALL BE LIABLE
* FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES
* FOR ANY REASON RELATED TO THIS SOFTWARE, EVEN IF RENESAS OR ITS
* AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this
* software and to discontinue the availability of this software.
* By using this software, you agree to the additional terms and
* conditions found by accessing the following link:
* http://www.renesas.com/disclaimer
*********************************************************************************************************************/
/* Copyright (C) 2012 (2013-2016) Renesas Electronics Corporation. All rights reserved.                             */
/********************************************************************************************************************
* File Name     : r_iic_drv_sfr_rl78l1c.c
* Version       : 1.03
* Device(s)     : RL78/L1C
* Tool-Chain    : -
*               : 
* OS            : -
* H/W Platform  : -
* Description   : IIC driver IICA SFR module
* Operation     : -
* Limitations   : -
*********************************************************************************************************************
* History       : DD.MM.YYYY    Version Description
*               : 31.05.2012    1.00    Created
*               : 07.03.2013    1.01    Ver.1.01 Release
*               : 31.03.2014    1.02    Modified RL78/G14 driver.
*               : 31.03.2014    1.02    Supported IAR Embedded Workbench for Renesas RL78.
*               : 31.03.2016    1.03    Supported CC-RL.
*               :                       Added r_iic_drv_check_scl_level().
*               :                       -----------------------------------------------------------------------------
*********************************************************************************************************************/
#ifdef __CA78K0R__                                                          /* Renesas 78K0R, RL78 Compiler         */
    #pragma sfr
    #pragma DI
    #pragma EI
#endif  /* __CA78K0R__ */
#ifdef __CCRL__                                                             /* Renesas CC-RL Compiler               */
    #include "iodefine.h"                                                   /* for RL78                             */
#endif /* __CCRL__ */
#ifdef __ICCRL78__                                                          /* IAR 78K0R Compiler                   */
    #include <ior5f110pj.h>                                                 /* for RL78/L1C 100pin (R5F110PJ)       */  /** SET **/
    #include <ior5f110pj_ext.h>                                             /* for RL78/L1C 100pin (R5F110PJ)       */  /** SET **/
    #include "intrinsics.h"                                                 /* Header file for built in function    */
#endif  /* __ICCRL78__ */


/********************************************************************************************************************
Includes
*********************************************************************************************************************/
#include <stddef.h>

#ifdef __ICCRL78__
#include <stdbool.h>
#endif  /* __ICCRL78__ */

#include "r_iic_drv_api.h"
#include "r_iic_drv_sub.h"
#include "r_iic_drv_int.h"
#include "r_iic_drv_sfr.h"
#include "r_iic_drv_os.h"


/********************************************************************************************************************
Macro definitions
*********************************************************************************************************************/


/********************************************************************************************************************
Typedef definitions
*********************************************************************************************************************/


/********************************************************************************************************************
Exported global variables (to be accessed by other files)
*********************************************************************************************************************/


/********************************************************************************************************************
Private global variables and functions
*********************************************************************************************************************/


/********************************************************************************************************************
* Function Name : r_iic_drv_io_open
* Description   : Sets output latch value setting to Low. Also, sets ports to input mode.
* Arguments     : r_iic_drv_info_t *pRIic_Info      ;   IIC Information
* Return Value  : None
*********************************************************************************************************************/
void r_iic_drv_io_open(r_iic_drv_info_t *pRIic_Info)
{
    /* Channel number? */
    switch (pRIic_Info->ChNo)
    {
        case 0U:                                                /* Channel 0                                        */
#ifdef IICA0_ENABLE
            R_IIC_P_SCL0    = R_IIC_LOW;                        /* SCL0 output latch value setting to Low           */
            R_IIC_P_SDA0    = R_IIC_LOW;                        /* SDA0 output latch value setting to Low           */

            R_IIC_PM_SCL0   = R_IIC_IN;                         /* SCL0 input mode                                  */
            R_IIC_PM_SDA0   = R_IIC_IN;                         /* SDA0 input mode                                  */
#endif /* #ifdef IICA0_ENABLE */
        break;

        default:
        
